OpenNuvoton/M2354BSP/SampleCode/StdDriver/CRYPTO_AES_GCM/main.c
/**************************************************************************//**
 * @file     main.c
 * @version  V1.11
 * @brief    Demonstrate how to encrypt/decrypt data by AES GCM.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"

#define GCM_MODE    (AES_MODE_GCM << CRPT_AES_CTL_OPMODE_Pos)
#define GHASH_MODE  (AES_MODE_GHASH << CRPT_AES_CTL_OPMODE_Pos)
#define CTR_MODE    (AES_MODE_CTR << CRPT_AES_CTL_OPMODE_Pos)

#define DMAEN       CRPT_AES_CTL_DMAEN_Msk
#define DMALAST     CRPT_AES_CTL_DMALAST_Msk
#define DMACC       CRPT_AES_CTL_DMACSCAD_Msk
#define START       CRPT_AES_CTL_START_Msk
#define FBIN        CRPT_AES_CTL_FBIN_Msk
#define FBOUT       CRPT_AES_CTL_FBOUT_Msk


#define GCM_PBLOCK_SIZE  128     /* NOTE: This value must be 16 bytes alignment. This value must > size of A */

#define MAX_GCM_BUF     4096
__ALIGNED(4) uint8_t g_au8Buf[MAX_GCM_BUF];
__ALIGNED(4) uint8_t g_au8Out[MAX_GCM_BUF];
__ALIGNED(4) uint8_t g_au8Out2[MAX_GCM_BUF];
__ALIGNED(4) uint8_t g_au8FeedBackBuf[72] = {0};

/* for the key and data in binary format */
__ALIGNED(4) uint8_t g_key[32] = { 0 };
__ALIGNED(4) uint8_t g_iv[32] = { 0 };
__ALIGNED(4) uint8_t g_A[512] = { 0 };
__ALIGNED(4) uint8_t g_P[512] = { 0 };
__ALIGNED(4) uint8_t g_C[512] = { 0 };
__ALIGNED(4) uint8_t g_T[32] = { 0 };


typedef struct
{
    char *pchKey;   /* The block cipher key */
    char *pchIV;    /* The initialization vector */
    char *pchA;     /* The additional authenticated data */
    char *pchP;     /* The plaintext */
    char *pchC;     /* The ciphertext */
    char *pchTag;   /* The authentication tag */
} GCM_TEST_T;

/* Test items */
const GCM_TEST_T sElements[] =
{
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "28bbbc081544db64c6a462ebfcc71a98"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e0123456789",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b01122",
        "cbc2a71a9a0eddd39ac1a4d430b48ab4e4689869794cb48a9743957740661f963c",
        "c623ffe47619a24c3120d2c8fa7c1a1e"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "9a4562c3b90f65e0f1dc715b58c2faf4"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "28bbbc081544db64c6a462ebfcc71a98"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "51344aee87ddbcb21743e7aafefca60a"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "8ad1b737122d19deb791b1177adf138f"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "fc7ad781e089086b2c716c7909f91bb0"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "a406086eb74c238de45f11e7ca798367"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "c20d88d8cd64af02d89e8a77cdb04d2f"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "87590156b26185b25b9a08a00c6a528a"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "803c9ceaf8e6548f20762763575aa6ee"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "7ae5f9e22822f20c3961bca075991cfc"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "ac8a28ba37fd1932af26bf62c80f7e04"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "a700e05709d41111beccf49c83f53326"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "370f43d44b02a070b97b0091cd60c369"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9da",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "c80bb70c28fa92bd2fbd0015ef5f6c24"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadb",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "677e65ebc9e6a7f2415ba01ee3096327"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdc",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "0d7391e0823cba650c6368c90bae9838"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdd",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "9cec944c67f5186fd4980239835100c6"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcddde",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "0f4fe0030df3949f5a9ad2b3976edde4"
    },


    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf30",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "4c128777842f6e78467350e5e8a6fc9b"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf3031",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "9ee055d91b23af632984f0fc98b4b317"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf303132",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "011ed384548b2c554f5e9a1f2c371f87"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf30313233",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "121cd16b9cbbcd72a331f5985689d2fb"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf3031323334",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "74555167ba0cffaf88e5d9bb802eba5d"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf303132333435",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "7155d1d272d29c8a9ea126d62f09334e"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf30313233343536",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "da20d1c7ab9463bb9fdb15c5a33e9e21"
    },


