OpenNuvoton/M2354BSP/SampleCode/StdDriver/CRYPTO_AES_GCM/main.c
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68df",
        "9a4562c3b90f65e0f1dc715b58c2faf4"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b01122",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe8",
        "bdcb22e0cfe0c956d146d64195f60e9a"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b0112233",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835",
        "0e4b009b6bf17a85f369c11a664c4762"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011223344",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe83505",
        "48168c9baa5f064ad38962841acf31e9"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b01122334455",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe8350536",
        "ea52a16817b3a10eb900c8ab739df724"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b0112233445566",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835053625",
        "56a3e422b3a5328ad532109ce685038b"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011223344556677",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835053625d2",
        "b121a4c4cd2841158a796b4305e8fea5"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b01122334455667788",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835053625d2f0",
        "93d5f8e738fcd8123740eb84f9641096"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b0112233445566778899",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835053625d2f05c",
        "1b720c07b326322fd7bf808d83e72c04"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b0112233445566778899aa",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835053625d2f05c23",
        "5a2c9e159443aacf91eea86ab9554937"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b0112233445566778899aabb",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835053625d2f05c2315",
        "101f5cb551009e13f4a67927847c789f"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b0112233445566778899aabbcc",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835053625d2f05c2315e4",
        "182661cfb3e8e8cd983e5c0429715873"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b0112233445566778899aabbccdd",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835053625d2f05c2315e425",
        "e035b40fd2ed46c91861f1c73934295d"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b0112233445566778899aabbccddee",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835053625d2f05c2315e42557",
        "89bb7a59019b4dd84c00f40d106d5344"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b0112233445566778899aabbccddeeff",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835053625d2f05c2315e42557f7",
        "149f39acbe7c2b9c38889520e45915bc"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b0112233445566778899aabbccddeeff00",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835053625d2f05c2315e42557f748",
        "3a7e4105193c2a638e1765fa6692259b"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b0112233445566778899aabbccddeeff0011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835053625d2f05c2315e42557f748bb",
        "84064133d32b19fca8fcb2b642edc2c4"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b0112233445566778899aabbccddeeff001122",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835053625d2f05c2315e42557f748bbd8",
        "24e62f08f08ab7b236fbd810424f57a9"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b0112233445566778899aabbccddeeff00112233",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835053625d2f05c2315e42557f748bbd817",
        "665716fbe34c1829e81afddb8724d702"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b0112233445566778899aabbccddeeff0011223344",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfe835053625d2f05c2315e42557f748bbd81748",
        "2247b91f3d0d8559d1f46d2d35a0aa60"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b0",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68",
        "41db204d39ee6fdb8e356855f6558503"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "30d0d1d2d3d4d5d6d7d8d9dadbdcdddedf",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be",
        "7cf6381098e683c1757723c7c3ff960d"
    },
    {
        "FEFFE9928665731C6D6A8F9467308308",
        "CAFEBABEFACEDBADDECAF888",
        "3AD77BB40D7A3660A89ECAF32466EF97F5D3D58503B9699DE785895A96FDBAAF43B1CD7F598ECE23881B00E3ED0306887B0C785E27E8AD3F8223207104725DD4",
        "",
        "",
        "5F91D77123EF5EB9997913849B8DC1E9"
    },
    {
        "FEFFE9928665731C6D6A8F9467308308",
        "CAFEBABEFACEDBADDECAF888",
        "",
        "",
        "",
        "3247184B3C4F69A44DBCD22887BBB418",
    },
    {
        "FEFFE9928665731C6D6A8F9467308308",
        "CAFEBABEFACEDBADDECAF888",
        "",
        "D9313225F88406E5A55909C5AFF5269A86A7A9531534F7DA2E4C303D8A318A721C3C0C95956809532FCF0E2449A6B525B16AEDF5AA0DE657BA637B391AAFD255",
        "42831EC2217774244B7221B784D0D49CE3AA212F2C02A4E035C17E2329ACA12E21D514B25466931C7D8F6A5AAC84AA051BA30B396A0AAC973D58E091473F5985",
        "4D5C2AF327CD64A62CF35ABD2BA6FAB4",
    },
    {
        "FEFFE9928665731C6D6A8F9467308308",
        "CAFEBABEFACEDBADDECAF888",
        "3AD77BB40D7A3660A89ECAF32466EF97F5D3D58503B9699DE785895A96FDBAAF43B1CD7F598ECE23881B00E3ED0306887B0C785E27E8AD3F8223207104725DD4",
        "",
        "",
        "5F91D77123EF5EB9997913849B8DC1E9",
    },
    {
        "FEFFE9928665731C6D6A8F9467308308",
        "CAFEBABEFACEDBADDECAF888",
        "3AD77BB40D7A3660A89ECAF32466EF97F5D3D58503B9699DE785895A96FDBAAF43B1CD7F598ECE23881B00E3ED0306887B0C785E27E8AD3F8223207104725DD4",
        "D9313225F88406E5A55909C5AFF5269A86A7A9531534F7DA2E4C303D8A318A721C3C0C95956809532FCF0E2449A6B525B16AEDF5AA0DE657BA637B391AAFD255",
        "42831EC2217774244B7221B784D0D49CE3AA212F2C02A4E035C17E2329ACA12E21D514B25466931C7D8F6A5AAC84AA051BA30B396A0AAC973D58E091473F5985",
        "64C0232904AF398A5B67C10B53A5024D",
    },
    {
        "FEFFE9928665731C6D6A8F9467308308",
        "CAFEBABEFACEDBADDECAF888",
        "3AD77BB40D7A3660A89ECAF32466EF97F5D3D585",
        "D9313225F88406E5A55909C5AFF5269A86A7A9531534F7DA2E4C303D8A318A721C3C0C95956809532FCF0E2449A6B525B16AEDF5AA0DE657BA637B39",
        "42831EC2217774244B7221B784D0D49CE3AA212F2C02A4E035C17E2329ACA12E21D514B25466931C7D8F6A5AAC84AA051BA30B396A0AAC973D58E091",
        "F07C2528EEA2FCA1211F905E1B6A881B",
    },
    {
        "FEFFE9928665731C6D6A8F9467308308",
        "CAFEBABEFACEDBADDECAF888",
        "3AD77BB40D7A3660A89ECAF32466EF97F5D3D585",
        "D9313225F88406E5A55909C5AFF5269A86A7A9531534F7DA2E4C303D8A318A721C3C0C95956809532FCF0E2449A6B525B16AEDF5AA0DE657BA637B39",
        "42831EC2217774244B7221B784D0D49CE3AA212F2C02A4E035C17E2329ACA12E21D514B25466931C7D8F6A5AAC84AA051BA30B396A0AAC973D58E091",
        "F07C2528EEA2FCA1211F905E",
    },
    {
        "FEFFE9928665731C6D6A8F9467308308FEFFE9928665731C",
        "CAFEBABEFACEDBADDECAF888",
        "",
        "",
        "",
        "C835AA88AEBBC94F5A02E179FDCFC3E4",
    },
    {
        "FEFFE9928665731C6D6A8F9467308308FEFFE9928665731C",
        "CAFEBABEFACEDBADDECAF888",
        "",
        "D9313225F88406E5A55909C5AFF5269A86A7A9531534F7DA2E4C303D8A318A721C3C0C95956809532FCF0E2449A6B525B16AEDF5AA0DE657BA637B391AAFD255",
        "3980CA0B3C00E841EB06FAC4872A2757859E1CEAA6EFD984628593B40CA1E19C7D773D00C144C525AC619D18C84A3F4718E2448B2FE324D9CCDA2710ACADE256",
        "9924A7C8587336BFB118024DB8674A14",
    },
    {
        "FEFFE9928665731C6D6A8F9467308308FEFFE9928665731C",
        "CAFEBABEFACEDBADDECAF888",
        "3AD77BB40D7A3660A89ECAF32466EF97F5D3D58503B9699DE785895A96FDBAAF43B1CD7F598ECE23881B00E3ED0306887B0C785E27E8AD3F8223207104725DD4",
        "D9313225F88406E5A55909C5AFF5269A86A7A9531534F7DA2E4C303D8A318A721C3C0C95956809532FCF0E2449A6B525B16AEDF5AA0DE657BA637B391AAFD255",
        "3980CA0B3C00E841EB06FAC4872A2757859E1CEAA6EFD984628593B40CA1E19C7D773D00C144C525AC619D18C84A3F4718E2448B2FE324D9CCDA2710ACADE256",
        "3B9153B4E7318A5F3BBEAC108F8A8EDB",
    },
    {
        "FEFFE9928665731C6D6A8F9467308308FEFFE9928665731C",
        "CAFEBABEFACEDBADDECAF888",
        "3AD77BB40D7A3660A89ECAF32466EF97F5D3D585",
        "D9313225F88406E5A55909C5AFF5269A86A7A9531534F7DA2E4C303D8A318A721C3C0C95956809532FCF0E2449A6B525B16AEDF5AA0DE657BA637B39",
        "3980CA0B3C00E841EB06FAC4872A2757859E1CEAA6EFD984628593B40CA1E19C7D773D00C144C525AC619D18C84A3F4718E2448B2FE324D9CCDA2710",
        "93EA28C659E269902A80ACD208E7FC80",
    },
    {
        "FEFFE9928665731C6D6A8F9467308308FEFFE9928665731C",
        "CAFEBABEFACEDBADDECAF888",
        "3AD77BB40D7A3660A89ECAF32466EF97F5D3D585",
        "D9313225F88406E5A55909C5AFF5269A86A7A9531534F7DA2E4C303D8A318A721C3C0C95956809532FCF0E2449A6B525B16AEDF5AA0DE657BA637B39",
        "3980CA0B3C00E841EB06FAC4872A2757859E1CEAA6EFD984628593B40CA1E19C7D773D00C144C525AC619D18C84A3F4718E2448B2FE324D9CCDA2710",
        "93EA28C659E269902A80ACD2",
    },
    {
        "FEFFE9928665731C6D6A8F9467308308FEFFE9928665731C6D6A8F9467308308",
        "CAFEBABEFACEDBADDECAF888",
        "",
        "",
        "",
        "FD2CAA16A5832E76AA132C1453EEDA7E",
    },
    {
        "FEFFE9928665731C6D6A8F9467308308FEFFE9928665731C6D6A8F9467308308",
        "CAFEBABEFACEDBADDECAF888",
        "",
        "D9313225F88406E5A55909C5AFF5269A86A7A9531534F7DA2E4C303D8A318A721C3C0C95956809532FCF0E2449A6B525B16AEDF5AA0DE657BA637B391AAFD255",
        "522DC1F099567D07F47F37A32A84427D643A8CDCBFE5C0C97598A2BD2555D1AA8CB08E48590DBB3DA7B08B1056828838C5F61E6393BA7A0ABCC9F662898015AD",
        "B094DAC5D93471BDEC1A502270E3CC6C",
    },
    {
        "FEFFE9928665731C6D6A8F9467308308FEFFE9928665731C6D6A8F9467308308",
        "CAFEBABEFACEDBADDECAF888",
        "3AD77BB40D7A3660A89ECAF32466EF97F5D3D58503B9699DE785895A96FDBAAF43B1CD7F598ECE23881B00E3ED0306887B0C785E27E8AD3F8223207104725DD4",
        "",
        "",
        "DE34B6DCD4CEE2FDBEC3CEA01AF1EE44",
    },
    {
        "FEFFE9928665731C6D6A8F9467308308FEFFE9928665731C6D6A8F9467308308",
        "CAFEBABEFACEDBADDECAF888",
        "3AD77BB40D7A3660A89ECAF32466EF97F5D3D585",
        "D9313225F88406E5A55909C5AFF5269A86A7A9531534F7DA2E4C303D8A318A721C3C0C95956809532FCF0E2449A6B525B16AEDF5AA0DE657BA637B39",
        "522DC1F099567D07F47F37A32A84427D643A8CDCBFE5C0C97598A2BD2555D1AA8CB08E48590DBB3DA7B08B1056828838C5F61E6393BA7A0ABCC9F662",
        "E097195F4532DA895FB917A5A55C6AA0",
    },
    {
        "FEFFE9928665731C6D6A8F9467308308FEFFE9928665731C6D6A8F9467308308",
        "CAFEBABEFACEDBADDECAF888",
        "3AD77BB40D7A3660A89ECAF32466EF97F5D3D585",
        "D9313225F88406E5A55909C5AFF5269A86A7A9531534F7DA2E4C303D8A318A721C3C0C95956809532FCF0E2449A6B525B16AEDF5AA0DE657BA637B39",
        "522DC1F099567D07F47F37A32A84427D643A8CDCBFE5C0C97598A2BD2555D1AA8CB08E48590DBB3DA7B08B1056828838C5F61E6393BA7A0ABCC9F662",
        "E097195F4532DA895FB917A5",
    },

    {
        "f8d6868a7250f76e85de2e9f813edfc2",
        "0a",
        "30307aef4c3b7fa25ac7b181999851717f703a481bf59b16546bf2df7fc7d81677de6989cc64140470ab8b86a42ae498",
        "81e562083769c8ae8dfda00f192396a504b70dcea2c25ed0b89012ab9ebffbdad8f227d98951e75685b16bac064ceebd6b1840",
        "d1c2fa6ba5b29cb95f7819b2e6f2a7dbc0d8a58828f7e8528451633385afe0730921d08b50b7e0fa3be469cc72ff0e3226fb54",
        "b96cb72d696ad2325c36a55634a21d0f"
    },
    {
        "000102030405060708090A0B0C0D0E0F",
        "4d4d4d0000bc614e01234567",
        "",
        "01011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b01101011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b01101011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b01101011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b01101011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b01101011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b01101011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b01101011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b01101011000112233445566778899aabbccddeeff0000065f1f0400007e1f04b011",
        "801302ff8a7874133d414ced25b42534d28db0047720606b175bd52211be68dfcb07516352874b81dcc85f7020a2f36627caf3ae2a586a8c02251855e3f49930c14dea723535ba4c3cd85f2e7d01cfe5eee82c42b4c6a160a18ec05bf92e15c722fce31e21d10d07a58067de74c19b7cd48920e4248ee8824366ee7931d45e5589c50de4ff3a9c7512354377ccab95bd7dc0b36b8907fc486de47d495f20d621fb10d597a01e212766c4186f1e13c4c3c0d4dc29ae2cbd4f2363a0cf4c07cd3328cb3b2976ee5b3cfe13df884cfb2006c96d072682e58e8ea3807ed3901977e110ef9f38d4f200f82247b0a871cfb88556aa30997f460eae8be83f5e08c9ff90c8639d73ab213db0e2df2926827751cc05127a17cd38e187664dd972c9459f37",
        "b611211aade7dc390d68de47cd9e42fd"
    }
};

void DumpBuffHex(uint8_t *pucBuff, int nBytes)
{
    int32_t i32Idx, i, len;


    i32Idx = 0;
    while(nBytes > 0)
    {
        printf("0x%04X  ", i32Idx);

