OpenNuvoton/M2354BSP/SampleCode/StdDriver/CRYPTO_AES_GCM/main.c
        /* fill iv len to putput */
        if(iv_len == 12)
        {
            pbuf[15] = 1;
            u32Offset += iv_len_aligned;
        }
        else
        {
            /* Padding zero. 64'bit 0 */
            memset(&pbuf[iv_len_aligned], 0, 8);

            /* 64'bitlen(IV) */
            pu8 = &pbuf[iv_len_aligned + 8];
            *((uint64_t *)pu8) = iv_len * 8;
            swap64(pu8);
            u32Offset += iv_len_aligned + 16;
        }
    }


    /* A Section = 128'align(A) */
    if(A_len > 0)
    {
        A_len_aligned = A_len;
        if(A_len & 0xful)
            A_len_aligned = ((A_len + 16) >> 4) << 4;

        for(i = 0; i < A_len_aligned; i++)
        {
            if(i < A_len)
                pbuf[u32Offset + i] = A[i];
            else
                pbuf[u32Offset + i] = 0; // padding zero
        }

        u32Offset += A_len_aligned;
    }

    /* P/C Section = 128'align(P/C) */
    if(P_len > 0)
    {
        P_len_aligned = P_len;
        if(P_len & 0xful)
            P_len_aligned = ((P_len + 16) >> 4) << 4;

        for(i = 0; i < P_len_aligned; i++)
        {
            if(i < P_len)
                pbuf[u32Offset + i] = P[i];
            else
                pbuf[u32Offset + i] = 0; // padding zero
        }
        u32Offset += P_len_aligned;
    }

    *psize = u32Offset;

    return 0;
}

void AES_Run(uint32_t u32Option)
{
    uint32_t u32TimeOutCnt;

    g_Crypto_Int_done = 0;
    CRPT->AES_CTL = u32Option | START;
    /* Waiting for AES calculation */
    u32TimeOutCnt = SystemCoreClock; /* 1 second time-out */
    while(!g_Crypto_Int_done)
    {
        if(--u32TimeOutCnt == 0)
        {
            printf("Wait for AES calculation done time-out!\n");
            break;
        }
    }
}


/*
    AES_GCMTag is only used by AES_GCMEnc to calculate tag.
*/
static void AES_GCMTag(uint8_t *key, uint32_t klen, uint8_t *iv, uint32_t ivlen, uint8_t *A, uint32_t alen, uint8_t *P, uint32_t plen, uint8_t *tagbuf)
{
    int32_t i, len, plen_cur;
    uint8_t *pin, *pout;
    uint32_t inputblock[GCM_PBLOCK_SIZE * 2] = {0}; /* 2 block buffer, 1 for A, 1 for P */
    uint32_t ghashbuf[GCM_PBLOCK_SIZE + 16] = {0};
    uint8_t *pblock;
    uint32_t u32OptBasic;
    uint32_t u32OptKeySize;

    /* Prepare key size option */
    i = klen >> 3;
    u32OptKeySize = (((i >> 2) << 1) | (i & 1)) << CRPT_AES_CTL_KEYSZ_Pos;

    /* Basic options for AES */
    u32OptBasic = CRPT_AES_CTL_ENCRPT_Msk | CRPT_AES_CTL_INSWAP_Msk | CRPT_AES_CTL_OUTSWAP_Msk | u32OptKeySize;

    /* Set byte count of IV */
    CRPT->AES_GCM_IVCNT[0] = ivlen;
    CRPT->AES_GCM_IVCNT[1] = 0;
    /* Set bytes count of A */
    CRPT->AES_GCM_ACNT[0] = alen;
    CRPT->AES_GCM_ACNT[1] = 0;
    /* Set bytes count of P */
    CRPT->AES_GCM_PCNT[0] = plen;
    CRPT->AES_GCM_PCNT[1] = 0;


    // GHASH(128'align(A) || 128'align(C) || 64'bitlen(A) || 64'bitlen(C))
    // GHASH Calculation
    if(plen <= GCM_PBLOCK_SIZE)
    {
        /* Just one shot if plen < maximum block size */

        pblock = (uint8_t *)&inputblock[0];
        AES_GCMPacker(0, 0, A, alen, P, plen, pblock, (uint32_t *)&len);

        /* append 64'bitlen(A) || 64'bitlen(C) */
        pblock += len;
        *((uint64_t *)pblock) = alen * 8;
        swap64(pblock);
        pblock += 8;

        *((uint64_t *)pblock) = plen * 8;
        swap64(pblock);
        pblock += 8;

        /* adding the length of 64'bitlen(A) and 64'bitlen(C) */
        len += 16;

        pblock = (uint8_t *)&inputblock[0];
        printf("GHASH input (%d):\n", len);
        DumpBuffHex(pblock, len);

        AES_SetDMATransfer(CRPT, 0, (uint32_t)pblock, (uint32_t)&ghashbuf[0], len);

        AES_Run(u32OptBasic | GHASH_MODE | DMAEN | DMALAST);

        printf("GHASH output (%d):\n", len);
        DumpBuffHex((uint8_t *)&ghashbuf[0], len);

    }
    else
    {
        /* Calculate GHASH block by block, DMA casecade mode */

        /* feedback buffer is necessary for casecade mode */
        CRPT->AES_FBADDR = (uint32_t)&g_au8FeedBackBuf[0];
        memset(g_au8FeedBackBuf, 0, sizeof(g_au8FeedBackBuf));

        /* inital DMA for GHASH casecade */
        if(alen)
        {
            /* Prepare the blocked buffer for GCM */
            AES_GCMPacker(0, 0, A, alen, 0, 0, g_au8Buf, (uint32_t *)&len);

            printf("GHASH input (%d):\n", len);
            DumpBuffHex(g_au8Buf, len);

            AES_SetDMATransfer(CRPT, 0, (uint32_t)g_au8Buf, (uint32_t)&ghashbuf[0], len);

            AES_Run(u32OptBasic | GHASH_MODE | FBOUT | DMAEN);
        }

        /* Caculate GHASH block by block */
        pin = P;
        pout = (uint8_t *)&ghashbuf[0];
        plen_cur = plen;
        len = GCM_PBLOCK_SIZE;
        while(plen_cur)
        {

            len = plen_cur;
            if(len > GCM_PBLOCK_SIZE)
                len = GCM_PBLOCK_SIZE;
            plen_cur -= len;

            if(plen_cur)
            {
                /* Sill has data for next block, it means current block size is full size */

                printf("GHASH block input (%d):\n", len);
                DumpBuffHex(pin, len);

                /* len should be alway 16 bytes alignment in here */
                AES_SetDMATransfer(CRPT, 0, (uint32_t)pin, (uint32_t)pout, len);

                AES_Run(u32OptBasic | GHASH_MODE | FBIN | FBOUT | DMAEN | DMACC);
            }
            else
            {
                /* Next block data size is 0, it means current block size is not full size and this is last block */

                /* copy last C data to inputblock for zero padding */
                memcpy((uint8_t *)&inputblock[0], pin, len);
                pin = (uint8_t *)&inputblock[0];

                /* 16 bytes alignment check */
                if(len & 0xf)
                {
                    /* zero padding */
                    memset(pin + len, 0, 16 - (len & 0xf));

                    /* len must be 16 bytes alignment */
                    len = ((len + 16) >> 4) << 4;
                }

                /* append 64'bitlen(A) || 64'bitlen(C) */
                pblock = pin + len;
                *((uint64_t *)pblock) = alen * 8;
                swap64(pblock);
                pblock += 8;

                *((uint64_t *)pblock) = plen * 8;
                swap64(pblock);
                pblock += 8;

                /* adding the length of 64'bitlen(A) and 64'bitlen(C) */
                len += 16;

                printf("GHASH block input (%d):\n", len);
                DumpBuffHex(pin, len);


                AES_SetDMATransfer(CRPT, 0, (uint32_t)pin, (uint32_t)pout, len);

