OpenNuvoton/M2354BSP/SampleCode/StdDriver/CRYPTO_AES_GCM/main.c
                AES_Run(u32OptBasic | GHASH_MODE | FBIN | FBOUT | DMAEN | DMACC | DMALAST);

            }

            printf("GHASH block output (%d):\n", len);
            DumpBuffHex(pout, len);


            pin += len;
        }
    }

    // CTR(IV, GHASH(128'align(A) || 128'align(C) || 64'bitlen(A) || 64'bitlen(C)))
    // CTR calculation

    /* Prepare IV */
    if(ivlen != 12)
    {
        uint32_t u32ivbuf[4] = {0};
        uint8_t *piv;

        // IV = GHASH(128'align(IV) || 64'bitlen(0) || 64'bitlen(IV))

        piv = (uint8_t *)&u32ivbuf[0];
        AES_GCMPacker(iv, ivlen, 0, 0, 0, 0, g_au8Buf, (uint32_t *)&len);

        printf("IV GHASH input (%d):\n", len);
        DumpBuffHex(g_au8Buf, len);


        AES_SetDMATransfer(CRPT, 0, (uint32_t)g_au8Buf, (uint32_t)piv, len);

        AES_Run(u32OptBasic | GHASH_MODE | DMAEN | DMALAST);

        printf("IV GHASH output (%d):\n", len);
        DumpBuffHex(piv, len);

        /* SET CTR IV */
        for(i = 0; i < 4; i++)
        {
            CRPT->AES_IV[i] = (piv[i * 4 + 0] << 24) | (piv[i * 4 + 1] << 16) |
                              (piv[i * 4 + 2] << 8) | piv[i * 4 + 3];
        }
    }
    else
    {
        // IV = 128'align(IV) || 31'bitlen(0) || 1

        /* SET CTR IV */
        for(i = 0; i < 3; i++)
        {
            CRPT->AES_IV[i] = (iv[i * 4 + 0] << 24) | (iv[i * 4 + 1] << 16) |
                              (iv[i * 4 + 2] << 8) | iv[i * 4 + 3];
        }
        CRPT->AES_IV[3] = 0x00000001;
    }


    AES_SetDMATransfer(CRPT, 0, (uint32_t)&ghashbuf[0], (uint32_t)&tagbuf[0], 16);

    AES_Run(u32OptBasic | CTR_MODE | DMAEN | DMALAST);

    printf("Tag calculation:\n");
    DumpBuffHex((uint8_t *)&tagbuf[0], 16);

}


int32_t AES_GCMEnc(uint8_t *key, uint32_t klen, uint8_t *iv, uint32_t ivlen, uint8_t *A, uint32_t alen, uint8_t *P, uint32_t plen, uint8_t *buf, uint32_t *size, uint32_t *plen_aligned)
{
    int32_t plen_cur;
    int32_t len;
    uint8_t *pin, *pout;
    int32_t i;
    uint32_t u32OptKeySize;
    uint32_t u32OptBasic;

    printf("\n");

    printf("key (%d):\n", klen);
    DumpBuffHex(key, klen);

    printf("IV (%d):\n", ivlen);
    DumpBuffHex(iv, ivlen);

    printf("A (%d):\n", alen);
    DumpBuffHex(A, alen);

    printf("P (%d):\n", plen);
    DumpBuffHex(P, plen);

    /* Prepare the key */
    memcpy(g_au8Buf, key, klen);
    ToBigEndian(g_au8Buf, klen);
    for(i = 0; i < klen / 4; i++)
    {
        CRPT->AES_KEY[i] = *((uint32_t *)&g_au8Buf[i * 4]);
    }

    /* Prepare key size option */
    i = klen >> 3;
    u32OptKeySize = (((i >> 2) << 1) | (i & 1)) << CRPT_AES_CTL_KEYSZ_Pos;

    /* Basic options for AES */
    u32OptBasic = CRPT_AES_CTL_ENCRPT_Msk | CRPT_AES_CTL_INSWAP_Msk | CRPT_AES_CTL_OUTSWAP_Msk | u32OptKeySize;


    /* Set byte count of IV */
    CRPT->AES_GCM_IVCNT[0] = ivlen;
    CRPT->AES_GCM_IVCNT[1] = 0;

    /* Set bytes count of A */
    CRPT->AES_GCM_ACNT[0] = alen;
    CRPT->AES_GCM_ACNT[1] = 0;
    /* Set bytes count of P */
    CRPT->AES_GCM_PCNT[0] = plen;
    CRPT->AES_GCM_PCNT[1] = 0;

    *plen_aligned = (plen & 0xful) ? ((plen + 16) / 16) * 16 : plen;
    if(plen <= GCM_PBLOCK_SIZE)
    {
        /* Just one shot */

        /* Prepare the blocked buffer for GCM */
        AES_GCMPacker(iv, ivlen, A, alen, P, plen, g_au8Buf, size);


        printf("input blocks (%d):\n", *size);
        DumpBuffHex(g_au8Buf, *size);

        AES_SetDMATransfer(CRPT, 0, (uint32_t)g_au8Buf, (uint32_t)buf, *size);

        AES_Run(u32OptBasic | GCM_MODE | DMAEN | DMALAST);

        printf("output blocks (%d):\n", *size);
        DumpBuffHex(buf, *size);
    }
    else
    {

        /* Process P block by block, DMA casecade mode */

        /* inital DMA for AES-GCM casecade */

        /* Prepare the blocked buffer for GCM */
        AES_GCMPacker(iv, ivlen, A, alen, 0, 0, g_au8Buf, size);

        printf("input blocks for casecade 0 (%d):\n", *size);
        DumpBuffHex(g_au8Buf, *size);

        AES_SetDMATransfer(CRPT, 0, (uint32_t)g_au8Buf, (uint32_t)buf, *size);
        /* feedback buffer is necessary for casecade mode */
        CRPT->AES_FBADDR = (uint32_t)&g_au8FeedBackBuf[0];

        AES_Run(u32OptBasic | GCM_MODE | FBOUT | DMAEN);

        /* Start to encrypt P data */
        printf("P Block size for casecade mode %d\n", GCM_PBLOCK_SIZE);
        plen_cur = plen;
        pin = P;
        pout = buf;
        while(plen_cur)
        {
            len = plen_cur;
            if(len > GCM_PBLOCK_SIZE)
            {
                len = GCM_PBLOCK_SIZE;
            }
            plen_cur -= len;

            /* Prepare the blocked buffer for GCM */
            memcpy(g_au8Buf, pin, len);
            /* padding 0 if necessary */
            if(len & 0xf)
            {
                memset(&g_au8Buf[len], 0, 16 - (len & 0xf));
                len = ((len + 16) >> 4) << 4;
            }

            printf("input blocks for casecade (%d):\n", len);
            DumpBuffHex(g_au8Buf, len);

            AES_SetDMATransfer(CRPT, 0, (uint32_t)g_au8Buf, (uint32_t)pout, len);



            if(plen_cur)
            {
                /* casecade n */
                AES_Run(u32OptBasic | GCM_MODE | FBIN | FBOUT | DMAEN | DMACC);
            }
            else
            {
                /* last casecade */
                AES_Run(u32OptBasic | GCM_MODE | FBIN | FBOUT | DMAEN | DMACC | DMALAST);
            }

            printf("output blocks (%d):\n", len);
            DumpBuffHex(pout, len);

            pin += len;
            pout += len;
        }

        /* Total size is plen aligment size + tag size */
        *size = *plen_aligned + 16;

    }

    /* Need to calculate Tag when plen % 16 == 1 or 15 */
    if(((plen & 0xf) == 1) || ((plen & 0xf) == 15))
    {
        uint32_t tagbuf[4] = {0};

        AES_GCMTag(key, klen, iv, ivlen, A, alen, buf, plen, (uint8_t *)&tagbuf[0]);

        /* Update tag to output buffer */
        memcpy(buf + *plen_aligned, (uint8_t *)&tagbuf[0], 16);

